{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.10.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "tfgpt2lm_head_model/transformer/wpe/embeddings", "shape": [1024, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/wte/weight", "shape": [50259, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/ln_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/ln_1/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/attn/c_attn/weight", "shape": [64, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/attn/c_attn/bias", "shape": [1, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/attn/c_proj/weight", "shape": [64, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/attn/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/ln_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/ln_2/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/mlp/c_fc/weight", "shape": [64, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/mlp/c_fc/bias", "shape": [1, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/mlp/c_proj/weight", "shape": [256, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._0/mlp/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/ln_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/ln_1/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/attn/c_attn/weight", "shape": [64, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/attn/c_attn/bias", "shape": [1, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/attn/c_proj/weight", "shape": [64, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/attn/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/ln_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/ln_2/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/mlp/c_fc/weight", "shape": [64, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/mlp/c_fc/bias", "shape": [1, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/mlp/c_proj/weight", "shape": [256, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._1/mlp/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/ln_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/ln_1/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/attn/c_attn/weight", "shape": [64, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/attn/c_attn/bias", "shape": [1, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/attn/c_proj/weight", "shape": [64, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/attn/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/ln_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/ln_2/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/mlp/c_fc/weight", "shape": [64, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/mlp/c_fc/bias", "shape": [1, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/mlp/c_proj/weight", "shape": [256, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._2/mlp/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/ln_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/ln_1/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/attn/c_attn/weight", "shape": [64, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/attn/c_attn/bias", "shape": [1, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/attn/c_proj/weight", "shape": [64, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/attn/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/ln_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/ln_2/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/mlp/c_fc/weight", "shape": [64, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/mlp/c_fc/bias", "shape": [1, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/mlp/c_proj/weight", "shape": [256, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._3/mlp/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/ln_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/ln_1/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/attn/c_attn/weight", "shape": [64, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/attn/c_attn/bias", "shape": [1, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/attn/c_proj/weight", "shape": [64, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/attn/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/ln_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/ln_2/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/mlp/c_fc/weight", "shape": [64, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/mlp/c_fc/bias", "shape": [1, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/mlp/c_proj/weight", "shape": [256, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._4/mlp/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/ln_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/ln_1/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/attn/c_attn/weight", "shape": [64, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/attn/c_attn/bias", "shape": [1, 192], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/attn/c_proj/weight", "shape": [64, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/attn/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/ln_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/ln_2/beta", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/mlp/c_fc/weight", "shape": [64, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/mlp/c_fc/bias", "shape": [1, 256], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/mlp/c_proj/weight", "shape": [256, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/h_._5/mlp/c_proj/bias", "shape": [1, 64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/ln_f/gamma", "shape": [64], "dtype": "float32"}, {"name": "tfgpt2lm_head_model/transformer/ln_f/beta", "shape": [64], "dtype": "float32"}]}]}